; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v9 ?v12)
             (pred_4 ?v8 ?v10)
             (pred_7 ?v9 ?v10)
             (pred_1 ?v3 ?v9 )
	     (pred_2 ?v9)
             (pred_11 ?v5)
             (pred_3 ?v8)
             (pred_8 ?v10)
             (pred_12 ?v9)
             (pred_10 ?v8)
             (pred_5 ?v9)
             (pred_9 ))



(:action op_5
:parameters (?v7 ?v1 ?v6 ?v4)
:precondition (and (pred_11 ?v7) (pred_11 ?v1) (pred_3 ?v6) (pred_8 ?v4)
          (pred_6 ?v7 ?v1) (pred_4 ?v6 ?v4)
                   (pred_7 ?v1 ?v4) (pred_2 ?v7) 
                   (pred_12 ?v1) (pred_10 ?v6))
:effect (and  (pred_5 ?v1) (not (pred_12 ?v1))))


(:action op_3
:parameters (?v7 ?v2)
:precondition (and (pred_11 ?v7) (pred_11 ?v2)
               (pred_2 ?v7) (pred_6 ?v7 ?v2) (pred_5 ?v2))
:effect (and (pred_2 ?v2) (not (pred_2 ?v7))))

(:action op_4
:parameters (?v7 ?v6)
:precondition (and (pred_11 ?v7) (pred_3 ?v6) 
                  (pred_2 ?v7) (pred_1 ?v6 ?v7) (pred_9 ))
:effect (and (pred_10 ?v6)
   (not (pred_1 ?v6 ?v7)) (not (pred_9 ))))


(:action op_1
:parameters (?v7 ?v13 ?v11)
:precondition (and (pred_11 ?v7) (pred_3 ?v13) (pred_3 ?v11)
                  (pred_2 ?v7) (pred_10 ?v11) (pred_1 ?v13 ?v7))
:effect (and (pred_10 ?v13) (pred_1 ?v11 ?v7)
        (not (pred_10 ?v11)) (not (pred_1 ?v13 ?v7))))

(:action op_2
:parameters (?v7 ?v6)
:precondition (and (pred_11 ?v7) (pred_3 ?v6) 
                  (pred_2 ?v7) (pred_10 ?v6))
:effect (and (pred_9 ) (pred_1 ?v6 ?v7) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_28 obj_24 obj_04 obj_05 obj_03 obj_08 obj_17 obj_23 obj_18 obj_27 obj_11 obj_07 obj_22 obj_10 obj_32 obj_16 obj_12 obj_31 obj_15 obj_13 obj_19 obj_30 obj_02 obj_29
    obj_25 obj_06 obj_14
    obj_09 obj_26 obj_01 obj_20
    )

    (:init
       (pred_9)

       (pred_11 obj_21)
       (pred_11 obj_28)
       (pred_11 obj_24)
       (pred_11 obj_04)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_17)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_11)
       (pred_11 obj_07)
       (pred_11 obj_22)
       (pred_11 obj_10)
       (pred_11 obj_32)
       (pred_11 obj_16)
       (pred_11 obj_12)
       (pred_11 obj_31)
       (pred_11 obj_15)
       (pred_11 obj_13)
       (pred_11 obj_19)
       (pred_11 obj_30)
       (pred_11 obj_02)
       (pred_11 obj_29)
       (pred_8 obj_25)
       (pred_8 obj_06)
       (pred_8 obj_14)
       (pred_3 obj_09)
       (pred_3 obj_26)
       (pred_3 obj_01)
       (pred_3 obj_20)

       (pred_6 obj_21 obj_03)
       (pred_6 obj_21 obj_28)
       (pred_6 obj_28 obj_08)
       (pred_6 obj_28 obj_24)
       (pred_6 obj_28 obj_21)
       (pred_6 obj_24 obj_17)
       (pred_6 obj_24 obj_04)
       (pred_6 obj_24 obj_28)
       (pred_6 obj_04 obj_23)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_24)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_03 obj_27)
       (pred_6 obj_03 obj_08)
       (pred_6 obj_03 obj_21)
       (pred_6 obj_08 obj_11)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_28)
       (pred_6 obj_08 obj_03)
       (pred_6 obj_17 obj_07)
       (pred_6 obj_17 obj_23)
       (pred_6 obj_17 obj_24)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_23 obj_22)
       (pred_6 obj_23 obj_18)
       (pred_6 obj_23 obj_04)
       (pred_6 obj_23 obj_17)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_18 obj_23)
       (pred_6 obj_27 obj_32)
       (pred_6 obj_27 obj_11)
       (pred_6 obj_27 obj_03)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_08)
       (pred_6 obj_11 obj_27)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_22)
       (pred_6 obj_07 obj_17)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_22 obj_31)
       (pred_6 obj_22 obj_10)
       (pred_6 obj_22 obj_23)
       (pred_6 obj_22 obj_07)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_22)
       (pred_6 obj_32 obj_13)
       (pred_6 obj_32 obj_16)
       (pred_6 obj_32 obj_27)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_12)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_16 obj_32)
       (pred_6 obj_12 obj_30)
       (pred_6 obj_12 obj_31)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_16)
       (pred_6 obj_31 obj_02)
       (pred_6 obj_31 obj_15)
       (pred_6 obj_31 obj_22)
       (pred_6 obj_31 obj_12)
       (pred_6 obj_15 obj_29)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_15 obj_31)
       (pred_6 obj_13 obj_19)
       (pred_6 obj_13 obj_32)
       (pred_6 obj_19 obj_30)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_13)
       (pred_6 obj_30 obj_02)
       (pred_6 obj_30 obj_12)
       (pred_6 obj_30 obj_19)
       (pred_6 obj_02 obj_29)
       (pred_6 obj_02 obj_31)
       (pred_6 obj_02 obj_30)
       (pred_6 obj_29 obj_15)
       (pred_6 obj_29 obj_02)
       (pred_12 obj_12)
       (pred_12 obj_29)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_7  obj_12 obj_25)
       (pred_7  obj_29 obj_06)
       (pred_7  obj_11 obj_14)
       (pred_7  obj_10 obj_25)
       (pred_5 obj_21)
       (pred_5 obj_28)
       (pred_5 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_03)
       (pred_5 obj_08)
       (pred_5 obj_17)
       (pred_5 obj_23)
       (pred_5 obj_18)
       (pred_5 obj_27)
       (pred_5 obj_07)
       (pred_5 obj_22)
       (pred_5 obj_32)
       (pred_5 obj_16)
       (pred_5 obj_31)
       (pred_5 obj_15)
       (pred_5 obj_13)
       (pred_5 obj_19)
       (pred_5 obj_30)
       (pred_5 obj_02)

       (pred_4  obj_09 obj_25)
       (pred_4  obj_26 obj_06)
       (pred_4  obj_01 obj_14)
       (pred_4  obj_20 obj_14)
       (pred_1 obj_09 obj_03)
       (pred_1 obj_26 obj_12)
       (pred_1 obj_01 obj_28)
       (pred_1 obj_20 obj_13)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_1 obj_09 obj_15)
       (pred_1 obj_20 obj_16)
    ))
(:constraints
  (always (not (pred_2 obj_08)))
)
)

; plan
1. (op_3 obj_17 obj_23)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_23)
   goals met: 0 of 2
2. (op_3 obj_23 obj_22)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_22)
   goals met: 0 of 2
3. (op_3 obj_22 obj_31)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_31)
   goals met: 0 of 2
4. (op_3 obj_31 obj_02)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_02)
   goals met: 0 of 2
5. (op_3 obj_02 obj_30)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_30)
   goals met: 0 of 2
6. (op_3 obj_30 obj_19)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_19)
   goals met: 0 of 2
7. (op_3 obj_19 obj_13)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_13)
   goals met: 0 of 2
8. (op_4 obj_13 obj_20)
   deleted: (pred_1 obj_20 obj_13) (pred_9)
   added: (pred_10 obj_20)
   goals met: 0 of 2
9. (op_3 obj_13 obj_19)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_19)
   goals met: 0 of 2
10. (op_3 obj_19 obj_16)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_16)
   goals met: 0 of 2
11. (op_2 obj_16 obj_20)
   deleted: (pred_10 obj_20)
   added: (pred_9) (pred_1 obj_20 obj_16)
   goals met: 1 of 2
12. (op_3 obj_16 obj_32)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_32)
   goals met: 1 of 2
13. (op_3 obj_32 obj_27)
   deleted: (pred_2 obj_32)
   added: (pred_2 obj_27)
   goals met: 1 of 2
14. (op_3 obj_27 obj_03)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_03)
   goals met: 1 of 2
15. (op_4 obj_03 obj_09)
   deleted: (pred_1 obj_09 obj_03) (pred_9)
   added: (pred_10 obj_09)
   goals met: 1 of 2
16. (op_3 obj_03 obj_27)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_27)
   goals met: 1 of 2
17. (op_3 obj_27 obj_32)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_32)
   goals met: 1 of 2
18. (op_3 obj_32 obj_16)
   deleted: (pred_2 obj_32)
   added: (pred_2 obj_16)
   goals met: 1 of 2
19. (op_5 obj_16 obj_12 obj_09 obj_25)
   deleted: (pred_12 obj_12)
   added: (pred_5 obj_12)
   goals met: 1 of 2
20. (op_3 obj_16 obj_12)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_12)
   goals met: 1 of 2
21. (op_3 obj_12 obj_31)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_31)
   goals met: 1 of 2
22. (op_3 obj_31 obj_15)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_15)
   goals met: 1 of 2
23. (op_2 obj_15 obj_09)
   deleted: (pred_10 obj_09)
   added: (pred_9) (pred_1 obj_09 obj_15)
   goals met: 2 of 2
